Table of Contents
 Class Tools
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public static class Tools
Inheritance
object
Tools
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 ConnectionDataFromXml(string)
public static ConnectionData ConnectionDataFromXml(string xml)
Parameters
xml string
Returns
ConnectionData
 ConnectionDataToXml(ConnectionData)
public static string ConnectionDataToXml(ConnectionData model)
Parameters
model ConnectionData
Returns
string
 ModelFromFile(string)
public static ModelBIM ModelFromFile(string filePath)
Parameters
filePath string
Returns
ModelBIM
 ModelFromXml(string)
public static ModelBIM ModelFromXml(string xml)
Parameters
xml string
Returns
ModelBIM
 ModelToFile(ModelBIM, string)
public static void ModelToFile(ModelBIM model, string filePath)
Parameters
model ModelBIM
filePath string
 ModelToFile(List<ModelBIM>, string)
public static void ModelToFile(List<ModelBIM> model, string filePath)
Parameters
model List<ModelBIM>
filePath string
 ModelToXml(ModelBIM)
public static string ModelToXml(ModelBIM model)
Parameters
model ModelBIM
Returns
string
 ModelToXml(List<ModelBIM>)
public static string ModelToXml(List<ModelBIM> model)
Parameters
model List<ModelBIM>
Returns
string
 ModelsFromFile(string)
public static List<ModelBIM> ModelsFromFile(string filePath)
Parameters
filePath string
Returns
List<ModelBIM>
 ModelsFromXml(string)
public static List<ModelBIM> ModelsFromXml(string xml)
Parameters
xml string
Returns
List<ModelBIM>
 OpenModelContainerFromFile(string)
public static OpenModelContainer OpenModelContainerFromFile(string filePath)
Parameters
filePath string
Returns
OpenModelContainer
 OpenModelContainerFromXml(string)
public static OpenModelContainer OpenModelContainerFromXml(string xml)
Parameters
xml string
Returns
OpenModelContainer
 OpenModelContainerToFile(OpenModelContainer, string)
public static void OpenModelContainerToFile(OpenModelContainer model, string filePath)
Parameters
model OpenModelContainer
filePath string
 OpenModelContainerToXml(OpenModelContainer)
public static string OpenModelContainerToXml(OpenModelContainer model)
Parameters
model OpenModelContainer
Returns
string
 ProjectFromFile(string)
public static BIMProject ProjectFromFile(string filePath)
Parameters
filePath string
Returns
BIMProject
 ProjectFromXml(string)
public static BIMProject ProjectFromXml(string xml)
Parameters
xml string
Returns
BIMProject
 ProjectToFile(BIMProject, string)
public static void ProjectToFile(BIMProject project, string filePath)
Parameters
project BIMProject
filePath string
 ProjectToXml(BIMProject)
public static string ProjectToXml(BIMProject project)
Parameters
project BIMProject
Returns
string
 Edit this page